<!DOCTYPE html>
<html>
  <head>
    <!-- Google tag (gtag.js) -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=G-YX2C8F4GDP"></script>
    <script>
      window.dataLayer = window.dataLayer || [];
      function gtag(){dataLayer.push(arguments);}
      gtag('js', new Date());

      gtag('config', 'G-YX2C8F4GDP');
    </script>
    <meta http-equiv="content-type" content="text/html; charset=utf-8">
    <meta http-equiv="cache-control" content="no-cache">
    <meta http-equiv="expires" content="0">
    <meta http-equiv="pragma" content="no-cache">
    <meta name="author" content="Pablo Barenbaum">
    <meta name="description" content="Pablo Barenbaum">
    <title>Preguntas frecuentes sobre el final de PLP</title>
  </head>
  <body>
    <div>
    <h1 class="title">Preguntas frecuentes sobre el final de PLP</h1>
    <p>
      Esta p&aacute;gina re&uacute;ne algunas preguntas frecuentes sobre el final de Paradigmas de Programaci&oacute;n (FCEyN, UBA).
      Corresponden <strong>exclusivamente</strong> a las fechas de final en las que yo (Pablo Barenbaum) sea el profesor a cargo de tomar el final.
    </p>
    <h2>&#191;C&oacute;mo es la modalidad del examen?</h2>
    <p>
    El final puede ser oral o escrito, dependiendo del n&uacute;mero de inscriptxs.
    En caso de que sea escrito, el examen es a libro abierto.
    El examen escrito normalmente consta de 4 o 5 ejercicios y tiene una duraci&oacute;n de 3 horas. 
    </p>
    <h2>&#191;A partir de qu&eacute; n&uacute;mero de inscriptos el final es escrito?</h2>
    <p>
    Depender&aacute; del caso. No me parecer&iacute;a bueno que se especule en torno a eso. 
    </p>
    <h2>&#191;Los ejercicios son te&oacute;ricos o pr&aacute;cticos?</h2>
    <p>
    El examen es te&oacute;rico&ndash;pr&aacute;ctico, es decir, puede incluir tanto preguntas conceptuales
    como resoluci&oacute;n de problemas.
    No interesa que repitan definiciones de memoria, pero hay conceptos que son tan
    fundamentales para la materia que se espera que sean bien conocidos.
    En general, la mayor parte de los ejercicios son pr&aacute;cticos (en alguna medida similares a
    ejercicios de parcial y de las pr&aacute;cticas), pero a veces integran varios temas de la
    materia o aspiran a evaluar que los temas te&oacute;ricos est&eacute;n claros.
    Si cursaste la materia hace un tiempo, es recomendable que rehagas las pr&aacute;cticas
    a conciencia.
    </p>
    <h2>&#191;Qu&eacute; temas entran en el examen?</h2>
    <p>
    Entran todos los temas vistos en la materia.
    En relaci&oacute;n a los temas que tienen que ver con programaci&oacute;n,
    en general interesan las caracter&iacute;sticas del lenguaje de programaci&oacute;n que son
    propias y fundamentales del paradigma,
    en tanto que no interesan las caracter&iacute;sticas accidentales o muy espec&iacute;ficas
    de la herramienta
    (como uso de <em>typeclasses</em> en Haskell o metapredicados en Prolog).
    </p>
    <p>
    Si cursaste la versi&oacute;n de la materia correspondiente al plan de estudios de 2023
    ("plan nuevo"):
    <ol>
    <li> Programaci&oacute;n funcional en Haskell y esquemas de recursi&oacute;n.
    <li> Razonamiento ecuacional e inducci&oacute;n estructural.
    <li> Deducci&oacute;n natural para l&oacute;gica proposicional y de primer orden.
    <li> C&aacute;lculo-&lambda;, sistemas de tipos y sem&aacute;ntica operacional.
    <li> Unificaci&oacute;n e inferencia de tipos.
    <li> Programaci&oacute;n l&oacute;gica en Prolog.
    <li> M&eacute;todos de resoluci&oacute;n general y SLD.
    <li> (Rudimentos de) programaci&oacute;n orientada a objetos en SmallTalk.
    </ol>
    </p>
    <p>
    Si cursaste la versi&oacute;n de la materia correspondiente al plan de estudios de 1993
    ("plan viejo"):
    <ol>
    <li> Programaci&oacute;n funcional en Haskell y esquemas de recursi&oacute;n.
    <li> C&aacute;lculo-&lambda;, sistemas de tipos y sem&aacute;ntica operacional.
    <li> Subtipado.
    <li> Unificaci&oacute;n e inferencia de tipos.
    <li> Programaci&oacute;n l&oacute;gica en Prolog.
    <li> M&eacute;todos de resoluci&oacute;n general y SLD.
    <li> Programaci&oacute;n orientada a objetos con prototipos en JavaScript.
    <li> C&aacute;lculo-&varsigma;.
    </ol>
    </p>
    <h2>&#191;C&oacute;mo se determina la calificaci&oacute;n?</h2>
    <p>Los ejercicios no tienen puntaje numérico. Cada ejercicio se califica como "Bien", "Regular" o "Mal".</p>
    <p>La evaluación de un examen tiene una cuota muy grande de subjetividad.
       El criterio no es mecánico, y la calificación no tiene que ver solamente
       con una medida cuantitativa (cantidad de ejercicios resueltos correctamente) sino
       también cualitativa (conocimientos y habilidades que se demuestran, capacidad
       de extrapolar dichas habilidades, calidad de la entrega, claridad
       conceptual, prolijidad en la exposición, etc.).</p>
    <p>Para aprobar el examen con 4 no alcanza con tener bien resueltos el 40% de los ejercicios.
       Para aprobar con un 10 no se exige la ausencia total de errores.
       En general, es posible perdonar <em>bugs</em> o confusiones menores,
       pero no errores conceptuales u omisiones graves.</p>
    </p>
    <h2>&#191;Hay algún modelo de examen disponible?</h2>
    <p>
    Como regla general, no publico los exámenes finales que tomo.
    En general no es una buena idea hacer <em>overfitting</em> con modelos de final conocidos.
    Mi recomendación es estudiar de los apuntes y la bibliografía, hacer
    ejercicios de los distintos temas de la materia y consultar las dudas
    a docentes y compañerxs.
    La bibliografía recomendada suele incluir buenos ejercicios.
    Recomiendo también no fiarse de algunos modelos de examen que circulan,
    porque muchos de ellos están mal transcriptos, con enunciados incorrectos
    o incompletos.
    </p>
    <h2>&#191;Qu&eacute; bibliograf&iacute;a puedo consultar?</h2>
    <p>La elecci&oacute;n de bibliograf&iacute;a es algo muy personal.
       No hay un &uacute;nico libro que cubra &iacute;ntegramente los temas que se ven en la materia.
       Algunas fuentes:</p>
    <ul>
    <li>Programación funcional: cap&iacute;tulos 1&ndash;4 del libro de Bird [1], art&iacute;culo de Hutton [2].
    <li>Razonamiento ecuacional: cap&iacute;tulo 6 del libro de Bird [1].
    <li>Deducci&oacute;n natural: cap&iacute;tulos 2 y 6 del libro de Sørensen y Urzyczyn [3].
    <li>C&aacute;lculo-&lambda;: cap&iacute;tulos 5 y 9 del libro de Pierce [4].
    <li>Curry&ndash;Howard: cap&iacute;tulos 3 y 4 del del libro de Sørensen y Urzyczyn [3].
    <li>Inferencia de tipos: cap&iacute;tulo 22 del libro de Pierce [4].
    <li>Unificaci&oacute;n: secci&oacute;n 4.6 del libro de Baader y Nipkow [5].
    <li>Prolog: cap&iacute;tulos 2&ndash;4 del libro de Bramer [6].
    <li>Resolución: cap&iacute;tulos 1 y 2 del libro de Lloyd [7].
    <li>Programaci&oacute;n orientada a objetos en SmallTalk: cap&iacute;tulos 1&ndash;4 del "libro azul" (Goldberg y Robson) [8].
    <li>C&aacute;lculo-&varsigma;: cap&iacute;tulos 1 y 2 del libro de Abadi y Cardelli [9].
    </ul>
    <h3>Referencias</h3>
    <ul>
    <li> [1] Richard Bird. <em>Thinking functionally with Haskell</em>. Cambridge University Press, 2015.
    <li> [2] Graham Hutton. A tutorial on the universality and expressiveness of fold. <em>J. Functional Programming</em> 9 (4): 355-372, julio de 1999.
    <li> [3] Benjamin C. Pierce. <em>Types and Programming Languages</em>. The MIT Press, 2002.
    <li> [4] Morten Sørensen y Paweł Urzyczyn. <em>Lectures on the Curry-Howard Isomorphism</em>. Elsevier, 2006.
    <li> [5] Franz Baader y Tobias Nipkow. <em>Term Rewriting and All That</em>. Cambridge University Press, 1998.
    <li> [6] Max Bramer. <em>Logic Programming with Prolog</em>. Springer, 2005.
    <li> [7] John Wylie Lloyd. <em>Foundations of Logic Programming</em>, Second Edition. Springer-Verlag, 1993.
    <li> [8] Adele Goldberg y David Robson. <em>Smalltalk-80: the language and its implementation</em>
    <li> [9] Mart&iacute;n Abadi y Luca Cardelli. <em>A Theory of Objects</em>. Springer, 1996.
    </ul>
    <h2>Otras observaciones generales</h2>
    <ul>
    <li> El objetivo de esta página es poder dar una respuesta más completa,
         y no evitar que me hagan preguntas.
         Todas las preguntas son bienvenidas. Acepto mensajes por e-mail o
         Telegram, sin garantía de disponibilidad para responder a tiempo.
    <li> No te tomes tu calificaci&oacute;n en forma personal.
         Una nota no dice nada sobre tu rendimiento futuro.
         El peor de los casos puede ser desaprobar, y no es un caso tan malo.
    <li> La frase <em>mens sana in corpore sano</em> está un poco trillada pero es totalmente válida en cualquier actividad que requiera rendimiento intelectual.
         Además de estudiar, es necesario darse tiempo para hacer ejercicio físico, cuidar la alimentación, socializar, tener momentos de ocio y mantener una rutina de sueño suficiente y ordenado.
    </ul>
    </div>
  </body>
</html>

